

class UserInfo:

    user_alex = {
        'first_name': 'Алексей',
        'last_name': 'Алексеев',
        'address': 'пер. Мосфильмовский 2-й дом 3',
        'subway_station': 'Преображенская площадь',
        'phone_number': '+7979123234',
        'date': '24.06.2025',
        'comment': 'Когда привезете, не звоните в дверь. Постучите условным стуком, вот так: тук тук-тук тук'
    }
    user_andrew = {
        'first_name': 'Андрей',
        'last_name': 'Андрееев',
        'address': 'Саратовский 1-й, проезд дом 19',
        'subway_station': 'Текстильщики',
        'phone_number': '897912323430',
        'date': '24.07.2025',
        'comment': ''
    }

class FaqText:

    answers = {
        0: 'Сутки — 400 рублей. Оплата курьеру — наличными или картой.',
        1: 'Пока что у нас так: один заказ — один самокат. Если хотите покататься с друзьями, можете просто сделать несколько заказов — один за другим.',
        2: 'Допустим, вы оформляете заказ на 8 мая. Мы привозим самокат 8 мая в течение дня. Отсчёт времени аренды начинается с момента, когда вы оплатите заказ курьеру. Если мы привезли самокат 8 мая в 20:30, суточная аренда закончится 9 мая в 20:30.',
        3: 'Только начиная с завтрашнего дня. Но скоро станем расторопнее.',
        4: 'Пока что нет! Но если что-то срочное — всегда можно позвонить в поддержку по красивому номеру 1010.',
        5: 'Самокат приезжает к вам с полной зарядкой. Этого хватает на восемь суток — даже если будете кататься без передышек и во сне. Зарядка не понадобится.',
        6: 'Да, пока самокат не привезли. Штрафа не будет, объяснительной записки тоже не попросим. Все же свои.',
        7: 'Да, обязательно. Всем самокатов! И Москве, и Московской области.'
    }